testsuite/sysbench/results/oltp_write_only.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 5423.12 qps: 32555.43 (r/w/o: 0.00/21704.92/10850.51) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 5517.86 qps: 33105.20 (r/w/o: 0.00/22069.48/11035.72) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 5459.61 qps: 32765.56 (r/w/o: 0.00/21846.54/10919.02) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1318036
        other:                           659032
        total:                           1977068
    transactions:                        329580 (5490.84 per sec.)
    queries:                             1977068 (32938.18 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      5490.8406
    time elapsed:                        60.0237s
    total number of events:              329580

Latency (ms):
         min:                                    6.66
         avg:                                   23.31
         max:                                   84.01
         95th percentile:                       31.94
         sum:                              7681755.91

Threads fairness:
    events (avg/stddev):           2574.8438/29.93
    execution time (avg/stddev):   60.0137/0.01

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 5588.82 qps: 33553.90 (r/w/o: 0.00/22372.00/11181.90) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 5647.09 qps: 33882.91 (r/w/o: 0.00/22588.74/11294.17) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 5710.21 qps: 34245.62 (r/w/o: 0.00/22828.25/11417.37) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           1355741
        other:                           677942
        total:                           2033683
    transactions:                        339032 (5648.52 per sec.)
    queries:                             2033683 (33882.67 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      5648.5245
    time elapsed:                        60.0243s
    total number of events:              339032

Latency (ms):
         min:                                    7.08
         avg:                                   22.66
         max:                                   84.64
         95th percentile:                       30.81
         sum:                              7681060.68

Threads fairness:
    events (avg/stddev):           2648.4609/46.64
    execution time (avg/stddev):   60.0083/0.01